export const CardData = new Map([
  [
    "1",
    {
      id: 1,
      title: "Переход к позитивности",
      desc: "<strong>Практика и самоанализ!!</strong>",
    },
  ],
  [
    "2",
    {
      id: 2,
      title:
        "1️⃣ Когнитивный цикл (Фреймворк мышления и выполнения): Эффективный 6-шаговый процесс",
      desc: `
          <ul class="list-none pl-5">
            <li>Оставайтесь спокойными 🧘‍♂️</li>
            <li>Проверьте 🔄</li>
            <li>Расставьте приоритеты 🎯</li>
            <li>Пересмотрите 🔍</li>
            <li>Практикуйте 🛠</li>
            <li>Размышляйте 💭</li>
            <li>Повторяйте 🔁</li>
          </ul>
        `,
    },
  ],
  [
    "3",
    {
      id: 3,
      title:
        "2️⃣ Модель обработки данных (Как работают мозг и системы): Модульный подход",
      desc: `
          <ul class="list-none pl-5">
            <li>Собирайте 📥</li>
            <li>Обрабатывайте ⚙️</li>
            <li>Храните 💾</li>
            <li>Применяйте 🚀</li>
            <li>Повторяйте 🔁</li>
          </ul>
        `,
    },
  ],
  [
    "4",
    {
      id: 4,
      title:
        "3️⃣ Модель мотивации и роста (Психологическая и поведенческая наука): Модель 4 толчков",
      desc: `
          <ol class="list-none pl-5">
            <li><strong>Дискомфорт →</strong> Силовой толчок (Разрушить инерцию) 💥</li>
            <li><strong>Улучшение →</strong> Веселый толчок (Итерировать и наслаждаться) 😃</li>
            <li><strong>Плато →</strong> Намеренный толчок (Разрушить застой) 🚀</li>
            <li><strong>Успех →</strong> Толчок мастерства (Улучшить до совершенства) 🏆</li>
            <li>Повторяйте 🔁</li>
          </ol>
        `,
    },
  ],
  [
    "5",
    {
      id: 5,
      title: "Обобщенный план обучения",
      desc: `
          <ol class="list-none pl-5">
            <li>🛠 <strong>Шаг 1:</strong> Основа → Поймите ключевую терминологию 🧐</li>
            <li>🔍 <strong>Шаг 2:</strong> Укрепите понимание → Исследуйте FAQ 💡</li>
            <li>🛠 <strong>Шаг 3:</strong> Практический подход → Делайте практику немедленно 🛠</li>
            <li>🔑 <strong>Шаг 4:</strong> Направленный путь → Просмотрите предварительные требования 🎯</li>
            <li>🚀 <strong>Шаг 5:</strong> Масштабирование и дальнейшее исследование → Следующая ссылка 🚀</li>
            <li>Повторяйте 🔁</li>
          </ol>
        `,
    },
  ],
  [
    "6",
    {
      id: 6,
      title: "Многоуровневый подход",
      desc: `
          <ul class="list-none pl-5">
            <li>Ввод 📥</li>
            <li>Обработка ⚙️</li>
            <li>Хранение 💾</li>
            <li>Действие 🎬</li>
          </ul>
        `,
    },
  ],
  [
    "7",
    {
      id: 7,
      title: '🔁 Модель рекурсивного возврата "SHANTI"',
      desc: `
      <ul class="list-none pl-5">
          <li>Успокойте разум, выйдите из усталости или страха 🧘‍♂️</li>
          <li>Услышьте свой разум – как вы себя чувствуете сегодня</li>
          <li>Маленький действенный шаг – Resume / Code / Profile</li>
          <li>Запишите то, что сделали, в 1 строке (размышление)</li>
          <li>Поблагодарите себя — "Я попытался"</li>
          <li>Повторите ту же последовательность завтра 🔁</li>
      </ul>
      `,
    },
  ],
]);

// export default CardData;

export const AboutContent = {
  title: "О вашей позитивности",
  description:
    "Этот инструмент помогает вам раскрыть свою внутреннюю силу через мотивационные цитаты! 🚀",
  why: `Потому что иногда нам просто нужен небольшой толчок, чтобы увидеть светлую сторону жизни! 🌟<br><br>
          <strong>Почему я?</strong> Потому что я верю в постоянное самосовершенствование и 
          распространение позитивности! Каждый день - это новая возможность расти и вдохновлять других. 🚀🔥`,
  version: "v1.0.4",
  closeButtonTitle: "🔵 Понятно!",
};

export const HeaderContent = {
  title: "🚀 Узнайте свою позитивность! Раскройте свою силу! 🪄",
};

export const ThanksNote = "Спасибо, что остаетесь с нами!";

export const LangText = "Русский";

